#  Use of loc & iloc
- df.loc[start:stop:step, start:stop:step]
- df.iloc[start:stop:step,start:stop:step]     here index is supplied
First parameter for rows
Second parameters for columns

In [5]:
# Usage example
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [6]:
# output only one column
course = df.loc[:,"Courses"]    # by using loc
course_i = df.iloc[:,0]         # by using iloc

print(course)
print(" ")
print(course_i)

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [7]:
# output only one row
r1 = df.loc["r1",:]
print(r1)
print(" ")
r1_i = df.iloc[0,:]
print(r1_i)

Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: r1, dtype: object

Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: r1, dtype: object

In [8]:
# Extracting specific data
# for eg to o/p python
py = df.loc["r4","Courses"]   # using loc
print(py)

# using iloc
py_i = df.iloc[3,0]
print(py_i)

Python
Python

In [21]:
# condition
greater = df.loc[df['Fee']>24000]
print(greater)

print("-------------------------------------------  ")

greater_i = df.iloc[list(df['Fee']>24000)]   # use list when using conditions with iloc
print(greater_i)
# print(type(df['Fee']>24000))

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
-------------------------------------------
    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

# Use of Groupby

DataFrame.groupby(by=None, axis=0, level=None, as_index=True, 
       sort=True, group_keys=True, squeeze=<no_default>, 
       observed=False, dropna=True)

In [52]:
# Example
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [53]:
df_1 = df.groupby(['Courses',"Discount"],dropna = True).sum().reset_index()
df_1.iloc[1,0] = "HEHE"
df_1

   Courses  Discount    Fee
0   Hadoop    1000.0  23000
1     HEHE       0.0   1500
2   Pandas    2500.0  26000
3  PySpark    2300.0  25000
4   Python    1200.0  24000
5   Python    1600.0  22000
6    Spark    1000.0  22000
7    Spark    1400.0  25000

In [51]:
df.groupby(["Courses"]).aggregate(['min','max'])

           Fee        Duration         Discount
           min    max      min     max      min     max
Courses
Hadoop   23000  25000   35days  55days   1000.0  1000.0
NA        1500   1500   40days  40days      0.0     0.0
Pandas   26000  26000   60days  60days   2500.0  2500.0
PySpark  25000  25000   50days  50days   2300.0  2300.0
Python   22000  24000   40days  50days   1200.0  1600.0
Spark    22000  25000   30days  30days   1000.0  1400.0